<template>
    <div class="main">
        <div class="main-post">
            <ul>
                <li
                    is="post-container"
                    v-for="post in posts"
                    v-bind:key="post.id"
                    v-bind:post="post"
                ></li>
            </ul>
        </div>
        <div class="main-pagination"></div>
    </div>
</template>

<script lang="ts">
import Vue from 'vue';
import PostContainer from './post-container.vue';

export default Vue.extend({
    name: 'Main',
    metaInfo: {
        title: 'mains'
    },
    components: {
        'post-container': PostContainer
    },
    data: function() {
        return {
            posts: [
                {
                    id: 1,
                    loveNumber: 100,
                    commentNumber: 120,
                    title:
                        '哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈',
                    createTime: '2018-10-10',
                    post:
                        '说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操说曹操曹操到说曹操曹操到说曹操曹操到，说曹操曹操到说曹操曹操到说曹操曹操到说曹操曹操到，说曹操曹操到说曹操曹操到说曹操曹操到'
                },
                {
                    id: 2,
                    loveNumber: 100,
                    commentNumber: 120,
                    title:
                        '哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈',
                    createTime: '2018-10-10',
                    post:
                        '说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操说曹操曹操到说曹操曹操到说曹操曹操到，说曹操曹操到说曹操曹操到说曹操曹操到说曹操曹操到，说曹操曹操到说曹操曹操到说曹操曹操到'
                },
                {
                    id: 3,
                    loveNumber: 100,
                    commentNumber: 120,
                    title:
                        '哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈',
                    createTime: '2018-10-10',
                    post:
                        '说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操说曹操曹操到说曹操曹操到说曹操曹操到，说曹操曹操到说曹操曹操到说曹操曹操到说曹操曹操到，说曹操曹操到说曹操曹操到说曹操曹操到'
                },
                {
                    id: 4,
                    loveNumber: 100,
                    commentNumber: 120,
                    title:
                        '哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈',
                    createTime: '2018-10-10',
                    post:
                        '说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操说曹操曹操到说曹操曹操到说曹操曹操到，说曹操曹操到说曹操曹操到说曹操曹操到说曹操曹操到，说曹操曹操到说曹操曹操到说曹操曹操到'
                },
                {
                    id: 5,
                    loveNumber: 100,
                    commentNumber: 120,
                    title:
                        '哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈',
                    createTime: '2018-10-10',
                    post:
                        '说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操说曹操曹操到说曹操曹操到说曹操曹操到，说曹操曹操到说曹操曹操到说曹操曹操到说曹操曹操到，说曹操曹操到说曹操曹操到说曹操曹操到'
                },
                {
                    id: 6,
                    loveNumber: 100,
                    commentNumber: 120,
                    title:
                        '哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈',
                    createTime: '2018-10-10',
                    post:
                        '说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操说曹操曹操到说曹操曹操到说曹操曹操到，说曹操曹操到说曹操曹操到说曹操曹操到说曹操曹操到，说曹操曹操到说曹操曹操到说曹操曹操到'
                },
                {
                    id: 7,
                    loveNumber: 100,
                    commentNumber: 120,
                    title:
                        '哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈',
                    createTime: '2018-10-10',
                    post:
                        '说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操曹操到说曹操曹操到操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操操曹操到说曹操说曹操曹操到说曹操曹操到说曹操曹操到，说曹操曹操到说曹操曹操到说曹操曹操到说曹操曹操到，说曹操曹操到说曹操曹操到说曹操曹操到'
                }
            ]
        };
    }
});
</script>

<style lang="scss" scoped>
ul {
    margin: 0px;
    padding: 0px;
}
.main {
    .main-post {
        max-height: 1600px;
        overflow: hidden;
    }
    .main-pagination {
        height: 60px;
        margin-top: 20px;
        border: 1px solid red;
    }
}
</style>
